<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>&nbsp;2&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;4&nbsp;High</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I02-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>Inbound "From Any allow all TCP" rules from Public IPs</td>

</tr>
<tr>

<td>I03-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>Inbound "From Any allow all UDP" rules from Public IPs</td>

</tr>
<tr>

<td>I05-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>TCP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I06-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>UDP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I08-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>src</td>

<td>Port 3020 can enter your network from Public IPs</td>

</tr>
<tr>

<td>I09-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>Database port TCP/9000 can enter your network from Public IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>&nbsp;2&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;4&nbsp;High</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>  I02-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all TCP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all TCP : PASS" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

            <td>GCP</td>

            <td>3020</td>

            <td>3050</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
<tr>

            <td>GCP</td>

            <td>9000</td>

            <td>9000</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></picture>  I03-I-GCP</summary> 

### **Title:**
Inbound "From Any allow all UDP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all UDP : PASS" are usually more open than is necessary. Allowing all UDP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

            <td>GCP</td>

            <td>3020</td>

            <td>3050</td>

            <td>udp</td>

            <td>0.0.0.0/0</td>

            </tr>
<tr>

            <td>GCP</td>

            <td>9000</td>

            <td>9000</td>

            <td>udp</td>

            <td>0.0.0.0/0</td>

            </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I05-I-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Public IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

            <td>GCP</td>

            <td>3020</td>

            <td>3050</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
<tr>

            <td>GCP</td>

            <td>9000</td>

            <td>9000</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I06-I-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Public IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you actually require. 
    

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

            <td>GCP</td>

            <td>3020</td>

            <td>3050</td>

            <td>udp</td>

            <td>0.0.0.0/0</td>

            </tr>
<tr>

            <td>GCP</td>

            <td>9000</td>

            <td>9000</td>

            <td>udp</td>

            <td>0.0.0.0/0</td>

            </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I08-I-GCP</summary> 

### **Title:**
Port 3020 can enter your network from Public IPs

### **Description:**
Your cloud estate is accessible using file sharing Protocol CIFS over port 3020. Allowing file sharing access from public IP addresses is risky.

### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I09-I-GCP</summary> 

### **Title:**
Database port TCP/9000 can enter your network from Public IPs

### **Description:**
Your cloud Hadoop database is accessible using administrative port TCP/9000. Hadoop is a framework for distributed data processing that allows access to the data and may act as database. Opening Hadoop port for public IPs is risky

### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

            <td>GCP</td>

            <td>3020</td>

            <td>3050</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
<tr>

            <td>GCP</td>

            <td>9000</td>

            <td>9000</td>

            <td>tcp</td>

            <td>0.0.0.0/0</td>

            </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.i05-06-ni-gcp will be created
  + resource "google_compute_firewall" "i05-06-ni-gcp" {
      + creation_timestamp = (known after apply)
      + description        = "INGRESS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ports"
      + network            = "devsecops-network-gcp"
      + priority           = 1200
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "3020-3050",
              + "9000",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "3020-3050",
              + "9000",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @VITALYALGOSEC<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD